Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager
This interface specifies factory methods to create handles.

Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager.CreatePointHandle(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Creates a point handle.
location: Point in space where the handle will be created.
locationType: Handle location type.
effectType: Handle effect type.
Returns: A newly created point handle.

Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager.CreateLineHandle(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Creates a line handle.
line: Segment in space where the handle will be created.
locationType: Handle location type.
effectType: Handle effect type.
Returns: A newly created line handle.

Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager.CreatePolycurveHandle(Tekla.Structures.Geometry3d.Polycurve,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Creates a polycurve handle.
Remarks:
It is advisable to use simpler handles when possible (for example, a Tekla.Structures.Plugins.DirectManipulation.Services.Handles.LineHandle) since they
are more lightweight.
polycurve: Polycurve represented by the handle.
locationType: Handle location type.
effectType: Handle effect type.
Returns: A newly created polycurve handle.

Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager.CreatePolygonalSurfaceHandle(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Creates a polygonal surface handle.
surfaceContour: Contour of the surface.
locationType: Handle location type.
effectType: Handle effect type.
Returns: A newly created surface handle.

Tekla.Structures.Plugins.DirectManipulation.Core.IHandleManager.CreateArcHandle(Tekla.Structures.Geometry3d.Arc,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Creates an arc handle.
arc: The actual arc that the handle uses.
locationType: Handle location type.
effectType: Handle effect type.
Returns: